---
kind: property
id: P:Autodesk.Revit.DB.CurtainSystem.CurtainSystemType
source: html/128f8a8f-3c3b-3b60-9b72-3dd7ad7ebca7.htm
---
# Autodesk.Revit.DB.CurtainSystem.CurtainSystemType Property

get or set the type of the CurtainSystem.

## Syntax (C#)
```csharp
public CurtainSystemType CurtainSystemType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when the specified parameter curtainSystemType is Nothing nullptr a null reference ( Nothing in Visual Basic) .
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when the type of the CurtainSystem cannot be changed to the specified one.